#AttributeError:'DataFrameGroupBy'objecthasnoattribute'unstack'

"""
    AttributeError: 'DataFrameGroupBy' object has no attribute 'unstack'
        데이터 프레임 그룹바이 오브젝트는 unstack  object를 가지고 있지 않다는 에러

        pandas.core.frame.DataFrame
        pandas.core.groupby.generic.DataFrameGroupBy
        두개의 차이 때문에 발생하는 에러

        목차
            01. 발생 상황
                01_01. DataFrame을 GroupBy한 후 unstack 시도시 에러 발생
            02. 해결 방법
                타입을 DataFrame으로 변경시킬 수 있는 함수를 사용하면 됨
                    총 개수   : count()
                    최소값    : min()
                    최대값    : max()
                    합계      : sum()
                    평균      : mean()
                    분산      : var()
                    표준편차   : std()
                    등의 함수 사용하면 가능
                02_01. 예시코드

"""
import pandas as pd

# 데이터만들기 서울시 인구통게 추이 데이터
print("\n", "=" * 5, "01. 발생 상황 ", "=" * 5)


def data_get():
    data_lst = []
    data_lst.append({'년도': 2020, '지역구': '종로구', '총인구': 151581, '남자': 73323, '여자': 78258})
    data_lst.append({'년도': 2020, '지역구': '중구', '총인구': 126467, '남자': 60956, '여자': 65511})
    data_lst.append({'년도': 2020, '지역구': '용산구', '총인구': 222307, '남자': 107184, '여자': 115123})
    data_lst.append({'년도': 2020, '지역구': '성동구', '총인구': 319475, '남자': 156038, '여자': 163437})
    data_lst.append({'년도': 2020, '지역구': '광진구', '총인구': 357176, '남자': 172660, '여자': 184516})
    data_lst.append({'년도': 2020, '지역구': '동대문구', '총인구': 355917, '남자': 174965, '여자': 180952})
    data_lst.append({'년도': 2020, '지역구': '중랑구', '총인구': 384950, '남자': 189538, '여자': 195412})
    data_lst.append({'년도': 2020, '지역구': '성북구', '총인구': 437443, '남자': 209627, '여자': 227816})
    data_lst.append({'년도': 2020, '지역구': '강북구', '총인구': 301489, '남자': 145628, '여자': 155861})
    data_lst.append({'년도': 2020, '지역구': '도봉구', '총인구': 321875, '남자': 156070, '여자': 165805})
    data_lst.append({'년도': 2020, '지역구': '노원구', '총인구': 517866, '남자': 250093, '여자': 267773})
    data_lst.append({'년도': 2020, '지역구': '은평구', '총인구': 463468, '남자': 222298, '여자': 241170})
    data_lst.append({'년도': 2020, '지역구': '서대문구', '총인구': 317323, '남자': 148545, '여자': 168778})
    data_lst.append({'년도': 2020, '지역구': '마포구', '총인구': 366037, '남자': 171862, '여자': 194175})
    data_lst.append({'년도': 2020, '지역구': '양천구', '총인구': 437848, '남자': 214255, '여자': 223593})
    data_lst.append({'년도': 2020, '지역구': '강서구', '총인구': 578840, '남자': 279663, '여자': 299177})
    data_lst.append({'년도': 2020, '지역구': '구로구', '총인구': 427307, '남자': 212397, '여자': 214910})
    data_lst.append({'년도': 2020, '지역구': '금천구', '총인구': 248496, '남자': 126359, '여자': 122137})
    data_lst.append({'년도': 2020, '지역구': '영등포구', '총인구': 389064, '남자': 193653, '여자': 195411})
    data_lst.append({'년도': 2020, '지역구': '동작구', '총인구': 401650, '남자': 194064, '여자': 207586})
    data_lst.append({'년도': 2020, '지역구': '관악구', '총인구': 507757, '남자': 253433, '여자': 254324})
    data_lst.append({'년도': 2020, '지역구': '서초구', '총인구': 403569, '남자': 192683, '여자': 210886})
    data_lst.append({'년도': 2020, '지역구': '강남구', '총인구': 505092, '남자': 241373, '여자': 263719})
    data_lst.append({'년도': 2020, '지역구': '송파구', '총인구': 658321, '남자': 317559, '여자': 340762})
    data_lst.append({'년도': 2020, '지역구': '강동구', '총인구': 400375, '남자': 196757, '여자': 203618})
    data_lst.append({'년도': 2021, '지역구': '종로구', '총인구': 149553, '남자': 72200, '여자': 77353})
    data_lst.append({'년도': 2021, '지역구': '중구', '총인구': 25398, '남자': 60327, '여자': 65071})
    data_lst.append({'년도': 2021, '지역구': '용산구', '총인구': 220831, '남자': 106376, '여자': 114455})
    data_lst.append({'년도': 2021, '지역구': '성동구', '총인구': 315943, '남자': 153889, '여자': 162054})
    data_lst.append({'년도': 2021, '지역구': '광진구', '총인구': 354447, '남자': 170939, '여자': 183508})
    data_lst.append({'년도': 2021, '지역구': '동대문구', '총인구': 353398, '남자': 173533, '여자': 179865})
    data_lst.append({'년도': 2021, '지역구': '중랑구', '총인구': 381850, '남자': 187743, '여자': 194107})
    data_lst.append({'년도': 2021, '지역구': '성북구', '총인구': 432943, '남자': 207042, '여자': 225901})
    data_lst.append({'년도': 2021, '지역구': '강북구', '총인구': 298299, '남자': 143835, '여자': 154464})
    data_lst.append({'년도': 2021, '지역구': '도봉구', '총인구': 318504, '남자': 154251, '여자': 164253})
    data_lst.append({'년도': 2021, '지역구': '노원구', '총인구': 510086, '남자': 246022, '여자': 264064})
    data_lst.append({'년도': 2021, '지역구': '은평구', '총인구': 462315, '남자': 221154, '여자': 241161})
    data_lst.append({'년도': 2021, '지역구': '서대문구', '총인구': 315034, '남자': 147468, '여자': 167566})
    data_lst.append({'년도': 2021, '지역구': '마포구', '총인구': 364066, '남자': 170443, '여자': 193623})
    data_lst.append({'년도': 2021, '지역구': '양천구', '총인구': 433849, '남자': 211999, '여자': 221850})
    data_lst.append({'년도': 2021, '지역구': '강서구', '총인구': 580427, '남자': 280028, '여자': 300399})
    data_lst.append({'년도': 2021, '지역구': '구로구', '총인구': 424249, '남자': 210424, '여자': 213825})
    data_lst.append({'년도': 2021, '지역구': '금천구', '총인구': 247857, '남자': 125916, '여자': 121941})
    data_lst.append({'년도': 2021, '지역구': '영등포구', '총인구': 384942, '남자': 191344, '여자': 193598})
    data_lst.append({'년도': 2021, '지역구': '동작구', '총인구': 400196, '남자': 192834, '여자': 207362})
    data_lst.append({'년도': 2021, '지역구': '관악구', '총인구': 505115, '남자': 251832, '여자': 253283})
    data_lst.append({'년도': 2021, '지역구': '서초구', '총인구': 402853, '남자': 192178, '여자': 210675})
    data_lst.append({'년도': 2021, '지역구': '강남구', '총인구': 504522, '남자': 240977, '여자': 263545})
    data_lst.append({'년도': 2021, '지역구': '송파구', '총인구': 663358, '남자': 319452, '여자': 343906})
    data_lst.append({'년도': 2021, '지역구': '강동구', '총인구': 393107, '남자': 192841, '여자': 200266})
    return data_lst

data = data_get()

 
print(data)
print(type(data))
df_01 = pd.DataFrame(data)
print('df_01\n', type(df_01))
print(df_01)

df_01 = df_01.groupby(['년도','지역구'])
print(type(df_01))

print("\n", "=" * 5, "02. ", "=" * 5)
print("\n", "=" * 3, "02_01.", "=" * 3)

# 에러발생
# df_01 = df_01.unstack('지역구')

# 타입을 DataFrame으로 변경시킬 수 있는 함수를 사용하면 됨
print(type(df_01.sum().unstack('년도')))
print(df_01.sum().unstack('년도'))

print(type(df_01.mean().unstack('지역구')))
print(df_01.mean().unstack('지역구'))

